{
  "id": 1,
  "tenant_id": 966465554,
  "world_id": 3,
  "name": "The Orcs' Escape Saga",
  "description": "The full narrative of the escape from orcs and the encounter with the Silver Moon Order, detailing the events that led to the awakening of the Northern Orc Tribe.",
  "story_type": "linear",
  "content": "Мозг раскалывался, словно кто-то взболтал его, перелил в другой череп и разбил об пол.\n\nЯ открыл глаза. Свод был низким, из грубо тесаного камня, и в воздухе пахло сырой кожей, жиром и чем-то еще — острым, металлическим. Я попытался пошевелиться, но руки и ноги были скручены толстыми веревками, впивающимися в кожу.\n\nТогда я увидел их.\n\nТри орка. Не те пугала из детских сказок, а настоящие, живые горы мышц и шрамов. Они сидели вокруг костра в центре пещеры, и тени от них прыгали по стенам, исполняя какой-то дьявольский танец.\n\nСлева, уставясь в огонь бессмысленными, мутными глазами, сидел огромный зеленый увалень с выбитым зубом. Он методически точил каменный нож, скрежет которого резал слух.\n\nВторой, поменьше, но шире в плечах, с рыжей, жесткой, как проволока, шерстью, что-то жевал, издавая влажные, чавкающие звуки. Иногда он срывался и бил кулаком по земле, ругаясь на своем gutturalном наречии, от чего пламя костра вздрагивало.\n\nНо мой взгляд приковал третий. Он сидел напротив меня, спиной к огню, так что его лицо было скрыто в тени, только свет отражался в двух маленьких, желтых, как больная моча, глазах. Он не двигался. Он просто смотрел на меня.\n\nУвалень перестал точить нож. Тишина, обрывавшаяся только лишь хрустом костей во рту у рыжего, стала давить на уши.\n\n— Очнулся, — прохрипел сидящий напротив. Его голос звучал словно скрежет жерновов. — Значит, крепкий.\n\nОн подался вперед, выхватывая из полумрака лицо, изрезанное старыми шрамами, и ухмыльнулся, обнажив желтые клыки.\n\n— Надеюсь, ты вкусный, — сказал он и кивнул товарищам. — Мы голодны.\n\nОрки хором зарычали, и я понял, что худшее, что могло со мной случиться сегодня — это не то, что я проснулся. А то, что я, похоже, больше не усну.\n\nОрк с выбитым зубом — Увалень — первым пришел в движение. Он тяжело поднялся, и земля под моими ногами, кажется, даже качнулась. Он шагнул ко мне, закрывая свет костра своим массивным телом, и воздух вокруг меня стал густым, пропитанным запахом немытого тела и старой крови.\n\nЯ дернулся, пытаясь отползти, но веревки только больно впились в запястья. Я был беспомощен, как червяк на-hookе.\n\nУвалень схватил меня за грудь своей ладонью, размером с крышку сковородки, и рывком поставил на ноги. Мои колени дрожали, подгибаясь, но он не давал упасть, держа меня в воздухе, словно легкую куклу.\n\n— Куда ж ты, — прорычал Рыжий, сплевывая кость на пол. — Праздник только начинается.\n\nТретий орк, Главарь, не спускал с меня желтых глаз. Он медленно вытащил из-за пояса изогнутый клинок, похожий на большой серп. Лезвие было темным, покрытым слоем копоти и, вероятно, не одного столетия ржавчины.\n\nЯ инстинктивно зажмурился, ожидая удара, но его не последовало.\n\nВместо этого Главарь шагнул вперед и резким движением перерезал веревки, связывавшие мои ноги. Я рухнул на колени, едва не разломав челюсть о каменный пол.\n\n— Беги, — сказал Главарь.\n\nЯ замер. Уши заложило от собственного хрипа дыхания. Я не поверил. Я не мог поверить.\n\n— Чего? — выдохнул я, поднимая на него взгляд.\n\n— Беги, — повторил он, и его губы растянулись в отвратительной улыбке, обнажив десны. — Даю пять дыханий. Если успеешь до выхода — жив будешь. Если нет...\n\nОн провел пальцем по острию своего клинка.\n\n— ...станешь ужином.\n\nУвалень заржал, сотрясая своды пещеры. Рыжий подскочил, сжимая кулаки, готовясь к погоне.\n\nОдин. Я огляделся. Выход из пещеры был виден за их спинами — узкий просвет в камне, куда едва проникал серый свет луны. До него метров десять. Но между мной и свободой стояли три стены из мяса и ярости.\n\nДва. Мои ноги, онемевшие от веревок, едва слушались.\n\nТри. Рыжий уже припал на одну ногу, как зверь перед прыжком.\n\nАдреналин ударил в кровь горячей волной. Я не стал ждать счетчика «четыре». Я изо всех сил толкнул Уваля в колено — это было всё, на что хватило моих сил, — и когда он, зашатавшись, наклонился, я проскользнул под его рукой.\n\nЧетыре.\n\nЯ бежал сломя голову, перепрыгивая через кости и камни. Сзади раздался яростный рев, и земля вздрогнула от тяжелого прыжка. Я не оборачивался. Я знал: если я посмотрю назад, я умру.\n\nПять.\n\nВыход был близко. Я метнулся к свету.\n\nВыход оказался узким, словно трещина в черепе. Я протиснулся, обдирая плечи о камни до сырой плоти, и вывалился наружу, в ледяную ночную темноту.\n\nВпереди расстилался густой, колючий кустарник, а дальше — обрыв. Сзади раздался сухой треск, и каменная рама выхода рассыпалась в пыль. Увалень, не разбираясь, просто проломил ее своим массивным телом, вырываясь на волю вместе с остальными.\n\nЯ бросился в заросли. Колючки рвали одежду и кожу, царапая лицо, но я не обращал внимания. Эта боль была доброй. Она означала, что я все еще могу чувствовать.\n\n— Он там! — рявкнул Главарь.\n\nЯ услышал тяжелый топот позади — Рыжий уже нагонял, круша кусты своими сапогами.\n\nВпереди вздымался крутой осып — гора острых, сыпучих камней, уходящая к небу. Под ногами всё время крошилось и уходило из-под подошв. Бежать по нему было самоубийством, но идти было нельзя.\n\nЯ рисковал и начал взбираться.\n\nОрки, привыкшие к тяжелой поступи, пошли следом. Камни посыпались из-под их ног, градом сыплясь на меня. Я едва держался, вцепившись руками в острые выступы.\n\nВнезапно под ногами Рыжего, который шел ниже, хрустнуло. Огромный каменный пласт не выдержал его веса. С жутким воем он скатился вниз, сбивая с ног Уваля. Они с грохотом покатились в темноту, увлекая за собой лавину щебня.\n\nЯ замер, прижимаясь к холодной скале, и перевел дыхание.\n\nСверху, там, где начался осып, стоял Главарь. Он не оступился. Он смотрел вниз на своих поверженных товарищей, а потом медленно поднял голову и посмотрел на меня. В его желтых глазах не было ярости. Там был холодный, профессиональный интерес.\n\nОн не стал лезть следом по опасной скользкой осыпи. Вместо этого он повернул и побегом поехал вдоль края обрыва, выше, по твердому грунту.\n\nОн знал местность. Он собирался отрезать мне путь на вершине.\n\n— Проклятие, — прошипел я сквозь стиснутые зубы.\n\nНоги дрожали, легкие горели огнем. Я посмотрел наверх. До гребня оставалось метров двадцать. Если Главарь доберется туда раньше меня, он просто сбросит меня вниз камнем.\n\nЯ собрал последние силы и начал карабкаться быстрее, игнорируя боль в пальцах, скользящих по мху.\n\nСверху послышался стук металла о камень. Он уже там.\n\nЯ выдохнул и рывком подтянулся на край, перекатываясь на жесткую траву.\n\nТут же над головой свистнуло. Тяжелый камень, брошенный Главарем, пролетел в сантиметре от моего уха и рухнул в бездну.\n\nЯ вскочил, размахивая своим бесполезным маленьким ножом, который удалось вырезать из кармана еще в пещере. Главарь стоял в десяти метрах. Он не спеша вытащил свой серп.\n\n— Ну что, — сказал он, пройдясь из стороны в сторону, перекрывая мне путь к лесу. — Лапки выросли.\n\nВнезапно из лесной чащи, за спиной Главаря, донесся громкий хруст ветки.\n\nОрк замер. И я замер. Мы оба посмотрели в темноту деревьев.\n\nОттуда, тяжело ступая, вышла фигура. Ростом с орка, но прямая и двуногая, в тяжелой броне, отливавшей серебром в лунном свете.\n\n— Эй, скотины, — прозвучал низкий, спокойный человеческий голос. — Неужели не слышали сирену?\n\nЭто был наемник. Нет, это был охотник на чудовищ. На его груди поблескивал герб Охотничьего Гильда.\n\nГлаварь медленно повернулся к незнакомцу, забыв про меня.\n\n— Человек, — прохрипел он. — Твоя кровь ценится выше.\n\nЯ тихо отступил в тень. Шанс, возможно, только один.\n\nОхотник не достал оружия. Вместо этого он снял с пояса небольшой рог и поднес к губам. Резкий, пронзительный сигнал разрезал ночь, заставляя меня вздрогнуть. Орки взвыли, закрывая уши ладонями.\n\n— Это была проверка на слух, — спокойно сказал охотник, опуская рог. — Глухие или глупые не живут долго.\n\nГлаварь пришел в себя. Он издал боевой клич, сотрясший воздух, и бросился вперед. Увалень и Рыжий, грязные и избитые после падения, но всё ещё живые, выползли из оврага и присоединились к нему.\n\nТри против одного.\n\nЯ мог бы убежать. Путь в лес был открыт. Но что-то заставило меня замереть. Возможно, восхищение безумием человека, решившего сразиться с тремя монстрами в одиночку. А может быть, понимание того, что если орки убьют его, они придут за мной.\n\nОхотник выхватил из-за спины огромный двуручный меч, который казался легким, как перо. Он не отступил.\n\nПервым на него налетел Увалень. Охотник просто сделал шаг в сторону, пнул гиганта в колено, и когда тот, потеряв равновие, наклонился, одним плавным движением отсек ему голову. Тяжелое тело рухнуло с глухим стуком.\n\nРыжий кинулся со спины, но охотник даже не глянул на него; он просто высоко поднял ногу и пнул его сзади прямо в грудь. Рыжий отлетел на несколько метров и врезался в дерево, с хрустом ломая ствол.\n\nТеперь остался только Главарь. Он остановился, оглядев поле боя. Его желтые глаза сузились.\n\n— Ты не простой человек, — прошипел он.\n\n— А ты не простой орк, — ответил охотник, вытирая клинок о траву. — Ты говоришь.\n\nЯ понял, что это мой момент. Пока они заняты друг другом, я должен исчезнуть.\n\nЯ тихо, стараясь не наступать на ветки, начал пятиться к густой чаще. Но Главарь, словно почувствовав мое движение, резко обернулся.\n\n— Ты никуда не уйдешь, червяк! — рявкнул он.\n\nВ этот миг охотник атаковал. Его меч сверкнул молнией, но Главарь был быстрее. Он отскочил, и лезвие лишь рассекло воздух там, где только что была его шея. Но Главарь не контратаковал. Вместо этого он метнулся в мою сторону.\n\nОхотник попытался перехватить его, но Рыжий, который, как оказалось, лишь оглушен, вдруг приподнялся и бросился на мечника, цепляясь за ноги. Это дало Главарю секунду.\n\n— Нет! — крикнул охотник, отбрасывая Рыжего ударом рукояти.\n\nНо было поздно. Главарь уже был рядом. Его тяжелая рука сжала мое горло, поднимая меня в воздух. Я дернулся, хватая его за запястья, но его хватка была железной.\n\n— Здрасьте, — прохрипел я, пытаясь вдохнуть.\n\nОхотник замер. Его меч был направлен на нас, но он не мог ударить, не рискуя убить меня.\n\n— Отпусти его, — сказал охотник, и в его голосе прозвучали стальные нотки.\n\n— Или что? — усмехнулся Главарь, прижимая меня к себе как живой щит. — Ты его не спасешь.\n\nВ этот момент из леса, с той стороны, где стоял охотник, бесшумно вышла еще одна фигура. Женщина. Легкая, изящная, с двумя короткими мечами на поясе. Она подкралась к Рыжему, который все еще пытался встать, и одним точным ударом в шею отправила его в небытие.\n\n— Я здесь, — сказала она, не сводя глаз с Главаря.\n\nВ глазах Главаря читался шок. Он не ожидал, что за охотником стоит прикрытие.\n\n— Двое на одного? — прорычал он. — Нечестно.\n\n— Жизнь нечестна, — ответил охотник, делая шаг вперед. — Особенно для твоего вида.\n\nЯ чувствовал, как пальцы Главаря сжимаются все сильнее. Воздух заканчивался. Перед глазами поплыли черные круги. Мне нужно было что-то делать, и быстро.\n\nЯ вспомнил про свой маленький нож, который все еще сжимал в руке. Это было безумие. Но у меня не было выбора.\n\nЯ собрал последние силы и с размаху вонзил лезвие в руку Главаря, прямо в место, где сухожилия сходились на запястье.\n\nГлаварь взвыл от боли и рефлекторно разжал руку. Я упал на колени, хватая ртом воздух и кашляя.\n\nОхотник не упустил этот шанс.\n\nС боевым кличем он прыгнул вперед. Меч свистнул в воздухе, и голова Главаря полетела так же легко, как и голова его первого товарища. Тело орка рухнуло рядом со мной, все еще судорожно сжимая пальцы.\n\nТишина вернулась в лес. Только тяжелое дыхание охотника и шелест листвы нарушали ее.\n\nЯ сидел на земле, глядя на труп, и пытался остановить дрожь в руках.\n\n— Ты жив? — голос охотника прозвучал сверху.\n\nЯ поднял голову. Он стоял надо мной, вытирая кровь с лица.\n\n— Кажется, — хрипло ответил я. — Кто вы такие?\n\n— Мы — Орден Серебряной Луны, — сказала женщина, подходя ближе и убирая мечи в ножны. — А ты, парень, только что оказался в центре большой беды.\n\n— Какой? — спросил я, поднимаясь на ноги. Мне казалось, что худшее уже позади.\n\nОхотник указал мечом на безголовое тело Главаря.\n\n— Это был не простой разбойник, — сказал он серьезно. — Это был Главарь Северного Племени. А теперь, когда его нет, его племя проснется. Они почуют его кровь.\n\nЯ почувствовал, как холод пробежал по спине. Я хотел просто проснуться. Теперь же я оказался втянут в войну.\n\n— Что нам делать? — спросил я, чувствуя, как страх сменяется чем-то иным — решимостью, рожденной отчаянием.\n\nОхотник посмотрел на север, где небо наливалось багровым цветом зари.\n\n— Бежать, — сказал он. — И быстро. Потому что они уже идут.\n\nОн развернулся и зашагал вглубь леса. Женщина последовала за ним, но на мгновение остановилась, бросив на меня взгляд:\n\n— Ты с нами или с ними?\n\nЯ посмотрел на нож в своей руке, потом на спины уходящих людей. Оставаться здесь было верной смертью.\n\n— Я с вами, — сказал я, поднимаясь и убирая нож в карман. — Я с вами.\n\nМы побежали в сторону восходящего солнца, навстречу неизвестности. А сзади, с севера, уже доносился низкий, зловещий гул — голос тысячи орков, проснувшихся, чтобы отомстить.",
  "choice_ids": [],
  "connected_world_ids": [],
  "is_active": true,
  "created_at": "2026-01-25T23:54:44.893493+00:00",
  "updated_at": "2026-01-25T23:54:44.893493+00:00",
  "version": 1
}